Repository: dhis2/multi-calendar-dates
Catalog: i18n/*.po
Languages: cs, pt, zh

source: Couldn't find a monthly period for weekly period id "{{periodId}}"
cs: Nepodařilo se najít měsíční období pro týdenní období id "{{periodId}}"
pt: Não foi possível encontrar um período mensal para o id "{{periodId}}" do período semanal
zh: 无法为周周期 ID "{{periodId}}" 找到月周期

source: Couldn't find a weekly period for weekly period id "{{periodId}}"
cs: Nepodařilo se najít týdenní období pro ID týdenního období "{{periodId}}"
pt: Não foi possível encontrar um período semanal para o id "{{periodId}}" do período semanal
zh: 无法找到周周期 ID "{{periodId}}" 的周周期

source: Couldn't handle unknown period id "{{periodId}}"
cs: Nelze zpracovat neznámé id období "{{periodId}}"
pt: Não foi possível tratar o período id "{{periodId}}" desconhecido
zh: 无法处理未知周期 ID "{{periodId}}"

source: Could not find a period type for period id "{{periodId}}"
cs: Nepodařilo se najít typ období pro id období "{{periodId}}"
pt: Não foi possível encontrar um tipo de período para o período id "{{periodId}}"
zh: 无法为周期 ID "{{periodId}}" 找到周期类型

source: Could not determine a period type for period id "{{periodId}}"
cs: Nepodařilo se určit typ období pro id období "{{periodId}}"
pt: Não foi possível determinar um tipo de período para o id do período "{{periodId}}"
zh: 无法确定周期 ID "{{periodId}}" 的周期类型

source: Couldn't find a period type for weekly period id "{{periodId}}"
cs: Nepodařilo se najít typ období pro id týdenního období "{{periodId}}"
pt: Não foi possível encontrar um tipo de período para o id "{{periodId}}" do período semanal
zh: 找不到周周期 ID "{{periodId}}" 的周期类型

source: Bi-Week
cs: Dvoutýden
pt: Quinzenal
zh: 两周

source: Week
cs: Týden
pt: Semana
zh: 周

source: Date string is invalid, received "{{dateString}}"
cs: Datový řetězec je neplatný, přijato "{{dateString}}"
pt: A string de data é inválida, recebido "{{dateString}}"
zh: 日期字符串无效，收到 "{{dateString}}"

source: Date string format does not match the specified format. Expected {{format}} but got {{detectedFormat}}.
cs: Formát řetězce datumu neodpovídá zadanému formátu. Očekáváno {{format}}, ale vráceno {{detectedFormat}}.
pt: O formato da string de data não corresponde ao formato especificado. Esperado {{format}} mas obteve-se {{detectedFormat}}.
zh: 日期字符串格式与指定格式不符。预期为{{format}} ，但得到的是{{detectedFormat}} 。

source: Unrecognized date, received "{{date}}"
cs: Neuznané datum, přijato "{{date}}"
pt: Data não reconhecida, recebida "{{date}}"
zh: 未确认日期，收到 "{{date}}"

source: Year {{year}} is out of range.
cs: Rok {{year}} je mimo rozsah.
pt: Ano {{year}} está fora do intervalo.
zh: 年{{year}} 已超出范围。

source: Month {{month}} is out of range | 1 <= {{month}} <= 12.
cs: Měsíc {{month}} je mimo rozsah | 1 <= {{month}} <= 12.
pt: O mês {{month}} está fora do intervalo | 1 <= {{month}} <= 12.
zh: 月{{month}} 超出范围 | 1 <={{month}} <= 12。

source: Day {{day}} is out of range | 1 <= {{day}} <= {{daysInMonth}}.
cs: Den {{day}} je mimo rozsah | 1 <= {{day}} <= {{daysInMonth}}.
pt: Dia {{day}} está fora do intervalo | 1 <= {{day}} <= {{daysInMonth}}.
zh: 日{{day}} 超出范围 | 1 <={{day}} <={{daysInMonth}} 。

source: Date is not given
cs: Datum není uvedeno
pt: A data não foi fornecida
zh: 未提供日期

source: Date {{dateString}} is less than the minimum allowed date {{minDateString}}.
cs: Datum {{dateString}} je menší než minimální povolené datum {{minDateString}}.
pt: A data {{dateString}} é inferior à data mínima permitida {{minDateString}}.
zh: 日期{{dateString}} 小于允许的最小日期{{minDateString}} 。

source: Date {{dateString}} is greater than the maximum allowed date {{maxDateString}}.
cs: Datum {{dateString}} je větší než maximální povolené datum {{maxDateString}}.
pt: A data {{dateString}} é superior à data máxima permitida {{maxDateString}}.
zh: 日期{{dateString}} 大于允许的最大日期{{maxDateString}} 。
